uhnp/src/Documents/ВременныеРазницыМСФО/ВременныеРазницыМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВременныеРазницыМСФО</name>
  <registerRecords>AccumulationRegister.ДанныеМСФО</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проводки</name>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоДт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>CatalogRef.СчетаБД</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>СубконтоКт3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДт</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКт</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеДт</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиДт</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеКт</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельностиКт</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПРДт</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПРКт</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/ВременныеРазницыМСФО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СтандартныеПодсистемыКоманды

// Добавляет команду создания объекта на основании.
// 
// Параметры:
// 	КомандыСозданияНаОсновании - ТаблицаЗначений - перечень команд
// Возвращаемое значение:
// 	Неопределено, СтрокаТаблицыЗначений - Добавленная Команда.
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	
	Если ПравоДоступа("Добавление", МетаданныеДокумента) Тогда
		
		КомандаСоздатьНаОсновании						= КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер				= МетаданныеДокумента.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление			= ОбщегоНазначения.ПредставлениеОбъекта(МетаданныеДокумента);
		КомандаСоздатьНаОсновании.РежимЗаписи			= "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Заполняет список команд создания на основании.
// 
// Параметры:
// 	КомандыСозданияНаОсновании - ТаблицаЗначений - перечень команд
// 	Параметры - Структура - параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область Проведение

Функция ПодготовитьПараметрыПроведения(ДополнительныеСвойства, Отказ, ФормироватьПроводкиМСФО = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("Ссылка", ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	Реквизиты = МСФОУХ.РеквизитыДокумента(Запрос, "", "", Отказ);
	
	ДополнительныеСвойства.ДляПроведения.Вставить("Реквизиты", Реквизиты);
	
	Запрос.УстановитьПараметр("Ссылка",				Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("Период",				Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",		Реквизиты.Организация);
	Запрос.УстановитьПараметр("Сценарий",			Реквизиты.Сценарий);
	Запрос.УстановитьПараметр("ТипыОбъектовУчета",	Метаданные.ОпределяемыеТипы.ОбъектУчетаМСФО.Тип.Типы());
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаТаблицаПроводок(НомераТаблиц);
	Возврат ПроведениеСерверУХ.ДополнитьТаблицамиИзПакетаЗапросов(
		ДополнительныеСвойства.ТаблицыДляДвижений, Запрос, НомераТаблиц);

КонецФункции

Функция ТекстЗапросаТаблицаПроводок(НомераТаблиц = Неопределено)
	
	НомераТаблиц.Вставить("ДанныеМСФО", НомераТаблиц.Количество());
	
	Возврат 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ИСТИНА КАК ДебетКредит,
	|	&Организация КАК Организация,
	|	&Сценарий КАК Сценарий,
	|	Дт.СчетДт КАК Счет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Дт.СубконтоДт1) В (&ТипыОбъектовУчета)
	|			ТОГДА Дт.СубконтоДт1
	|		КОГДА ТИПЗНАЧЕНИЯ(Дт.СубконтоДт2) В (&ТипыОбъектовУчета)
	|			ТОГДА Дт.СубконтоДт2
	|		КОГДА ТИПЗНАЧЕНИЯ(Дт.СубконтоДт3) В (&ТипыОбъектовУчета)
	|			ТОГДА Дт.СубконтоДт3
	|		ИНАЧЕ Дт.СубконтоДт1
	|	КОНЕЦ КАК ОбъектУчета,
	|	Дт.СчетКт КАК КорСчет,
	|	Дт.ВалютаДт КАК Валюта,
	|	Дт.СуммаПРДт КАК СуммаПР,
	|	Дт.СубконтоДт1 КАК Субконто1,
	|	Дт.СубконтоДт2 КАК Субконто2,
	|	Дт.СубконтоДт3 КАК Субконто3,
	|	Дт.ПодразделениеДт КАК Подразделение,
	|	Дт.НаправлениеДеятельностиДт КАК НаправлениеДеятельности,
	|	Дт.СубконтоКт1 КАК КорСубконто1,
	|	Дт.СубконтоКт2 КАК КорСубконто2,
	|	Дт.СубконтоКт3 КАК КорСубконто3,
	|	Дт.ПодразделениеКт КАК КорПодразделение,
	|	Дт.НаправлениеДеятельностиКт КАК КорНаправлениеДеятельности,
	|	Дт.Комментарий КАК Комментарий,
	|	Дт.НомерСтроки КАК НомерПроводки
	|ИЗ
	|	Документ.ВременныеРазницыМСФО.Проводки КАК Дт
	|ГДЕ
	|	Дт.СуммаПРДт <> 0
	|	И Дт.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	ЛОЖЬ,
	|	&Организация,
	|	&Сценарий,
	|	Кт.СчетКт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Кт.СубконтоКт1) В (&ТипыОбъектовУчета)
	|			ТОГДА Кт.СубконтоКт1
	|		КОГДА ТИПЗНАЧЕНИЯ(Кт.СубконтоКт2) В (&ТипыОбъектовУчета)
	|			ТОГДА Кт.СубконтоКт2
	|		КОГДА ТИПЗНАЧЕНИЯ(Кт.СубконтоКт3) В (&ТипыОбъектовУчета)
	|			ТОГДА Кт.СубконтоКт3
	|	КОНЕЦ,
	|	Кт.СчетДт,
	|	Кт.ВалютаКт,
	|	Кт.СуммаПРКт,
	|	Кт.СубконтоКт1,
	|	Кт.СубконтоКт2,
	|	Кт.СубконтоКт3,
	|	Кт.ПодразделениеКт,
	|	Кт.НаправлениеДеятельностиКт,
	|	Кт.СубконтоДт1,
	|	Кт.СубконтоДт2,
	|	Кт.СубконтоДт3,
	|	Кт.ПодразделениеДт,
	|	Кт.НаправлениеДеятельностиДт,
	|	Кт.Комментарий,
	|	Кт.НомерСтроки
	|ИЗ
	|	Документ.ВременныеРазницыМСФО.Проводки КАК Кт
	|ГДЕ
	|	Кт.СуммаПРКт <> 0
	|	И Кт.Ссылка = &Ссылка";

КонецФункции

#КонецОбласти

#КонецЕсли
